certificates/WcfSvcUtil/SYSTEMQueryNIEMwcf.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="SYSTEMQueryNIEMwcf" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsp:Policy wsu:Id="WSHttpBinding_ISYSTEMQueryNIEMwcf_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="true"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding><wsaw:UsingAddressing/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/WcfService1"/><xs:element name="RetrieveQuery"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="SystemQuery" nillable="true" type="q1:SystemQuery" xmlns:q1="http://schemas.datacontract.org/2004/07/WcfService1"/></xs:sequence></xs:complexType></xs:element><xs:element name="RetrieveQueryResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="RetrieveQueryResult" nillable="true" type="q2:SystemQueryResponseWcf" xmlns:q2="http://schemas.datacontract.org/2004/07/WcfService1"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetData"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="value" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/WcfService1" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/WcfService1"><xs:complexType name="SystemQuery"><xs:sequence><xs:element minOccurs="0" name="context" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="SystemQuery" nillable="true" type="tns:SystemQuery"/><xs:complexType name="SystemQueryResponseWcf"><xs:sequence><xs:element minOccurs="0" name="Status" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="SystemQueryResponseWcf" nillable="true" type="tns:SystemQueryResponseWcf"/></xs:schema></wsdl:types><wsdl:message name="ISYSTEMQueryNIEMwcf_RetrieveQuery_InputMessage"><wsdl:part name="parameters" element="tns:RetrieveQuery"/></wsdl:message><wsdl:message name="ISYSTEMQueryNIEMwcf_RetrieveQuery_OutputMessage"><wsdl:part name="parameters" element="tns:RetrieveQueryResponse"/></wsdl:message><wsdl:message name="ISYSTEMQueryNIEMwcf_GetData_InputMessage"><wsdl:part name="parameters" element="tns:GetData"/></wsdl:message><wsdl:message name="ISYSTEMQueryNIEMwcf_GetData_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataResponse"/></wsdl:message><wsdl:portType name="ISYSTEMQueryNIEMwcf"><wsdl:operation name="RetrieveQuery"><wsdl:input wsaw:Action="http://tempuri.org/ISYSTEMQueryNIEMwcf/RetrieveQuery" message="tns:ISYSTEMQueryNIEMwcf_RetrieveQuery_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/ISYSTEMQueryNIEMwcf/RetrieveQueryResponse" message="tns:ISYSTEMQueryNIEMwcf_RetrieveQuery_OutputMessage"/></wsdl:operation><wsdl:operation name="GetData"><wsdl:input wsaw:Action="http://tempuri.org/ISYSTEMQueryNIEMwcf/GetData" message="tns:ISYSTEMQueryNIEMwcf_GetData_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/ISYSTEMQueryNIEMwcf/GetDataResponse" message="tns:ISYSTEMQueryNIEMwcf_GetData_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="WSHttpBinding_ISYSTEMQueryNIEMwcf" type="tns:ISYSTEMQueryNIEMwcf"><wsp:PolicyReference URI="#WSHttpBinding_ISYSTEMQueryNIEMwcf_policy"/><soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="RetrieveQuery"><soap12:operation soapAction="http://tempuri.org/ISYSTEMQueryNIEMwcf/RetrieveQuery" style="document"/><wsdl:input><soap12:body use="literal"/></wsdl:input><wsdl:output><soap12:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetData"><soap12:operation soapAction="http://tempuri.org/ISYSTEMQueryNIEMwcf/GetData" style="document"/><wsdl:input><soap12:body use="literal"/></wsdl:input><wsdl:output><soap12:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="SYSTEMQueryNIEMwcf"><wsdl:port name="WSHttpBinding_ISYSTEMQueryNIEMwcf" binding="tns:WSHttpBinding_ISYSTEMQueryNIEMwcf"><soap12:address location="https://localhost:44321/SYSTEMQueryNIEMwcf.svc"/><wsa10:EndpointReference><wsa10:Address>https://localhost:44321/SYSTEMQueryNIEMwcf.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port></wsdl:service></wsdl:definitions>